## APPEND Dictionary ke DataFrame

### Dictionary dengan value berupa string dan integer

In [1]:
import pandas as pd

# membuat data baru
df = pd.DataFrame({'no': [1, 2, 3, 4, 5],
                   'nama': ["Ahmad", "Budi", "Cindy", "Dani", "Emma"],
                   'hobi': ["belajar", "makan", "belajar", "makan", "makan"]})

df

   no   nama     hobi
0   1  Ahmad  belajar
1   2   Budi    makan
2   3  Cindy  belajar
3   4   Dani    makan
4   5   Emma    makan

In [2]:
# menambahkan data baru dengan format dictionary

data_baru = {'no': 6,
            'nama': "Fanny",
            'hobi': "jalan-jalan"
            }

data_baru

{'no': 6, 'nama': 'Fanny', 'hobi': 'jalan-jalan'}

In [3]:
df = df.append(data_baru, ignore_index=True)

df

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
3   4   Dani        makan
4   5   Emma        makan
5   6  Fanny  jalan-jalan

Data yang ditambahkan akan berada pada baris terakhir ```(6, Fanny, jalan-jalan)```

### Dictionary dengan value berupa list

In [4]:
dictionary = {'no': [7, 8],
              'nama': ["Gio", "Habibi"],
              'hobi': ["makan", "belajar"]}

dictionary

{'no': [7, 8], 'nama': ['Gio', 'Habibi'], 'hobi': ['makan', 'belajar']}

In [5]:
df1 = df.append(dictionary, ignore_index=True)

df1

       no           nama              hobi
0       1          Ahmad           belajar
1       2           Budi             makan
2       3          Cindy           belajar
3       4           Dani             makan
4       5           Emma             makan
5       6          Fanny       jalan-jalan
6  [7, 8]  [Gio, Habibi]  [makan, belajar]

Append akan menambahkan data kedalam satu baris saja, meskipun data yang ditambahkan (dictionary) berupa list

## Aturan APPEND

1. **Total keys** tidak harus sama dengan **total kolom**, kolom yang kosong akan diisi dengan NULL.
2. Urutan **keys** pada Dictionary tidak harus sama dengan urutan kolom pada DataFrame, yang penting **keys** harus sesuai.

In [6]:
df

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
3   4   Dani        makan
4   5   Emma        makan
5   6  Fanny  jalan-jalan

In [7]:
dict1 = {'no': 7,
         'nama': "Gaza"}

dict1

{'no': 7, 'nama': 'Gaza'}

In [8]:
# Contoh append dengan satu kolom

df1 = df.append(dict1, ignore_index=True)
df1

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
3   4   Dani        makan
4   5   Emma        makan
5   6  Fanny  jalan-jalan
6   7   Gaza          NaN

In [9]:
dict2 = {'no': 7,
         'nama': "Gaza",
         'cita-cita': "Dokter"}

dict2

{'no': 7, 'nama': 'Gaza', 'cita-cita': 'Dokter'}

In [10]:
# contoh append dengan menambahkan kolom baru

df2 = df.append(dict2, ignore_index=True)
df2

   no   nama         hobi cita-cita
0   1  Ahmad      belajar       NaN
1   2   Budi        makan       NaN
2   3  Cindy      belajar       NaN
3   4   Dani        makan       NaN
4   5   Emma        makan       NaN
5   6  Fanny  jalan-jalan       NaN
6   7   Gaza          NaN    Dokter

In [11]:
dict3 = {'nama': "Gaza",
         'hobi': "tidur",
         'no': 7}

dict3

{'nama': 'Gaza', 'hobi': 'tidur', 'no': 7}

In [12]:
# Contoh append dengan keys yang tidak berurutan

df3 = df.append(dict3, ignore_index=True)
df3

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
3   4   Dani        makan
4   5   Emma        makan
5   6  Fanny  jalan-jalan
6   7   Gaza        tidur

## APPEND DataFrame ke DataFrame

- Untuk data dengan kolom yang sama ```df = df1.append(df2)```
- Jika kolomnya tidak sama kita perlu menentukan ```df = df1.merge(df2, on=..., how=...,) ```

### menggabungkan DataFrame dengan kolom yang sama

In [13]:
# membuat dua DataFrame baru
df_a = pd.DataFrame({'no': [1, 2, 3],
                   'nama': ["Ahmad", "Budi", "Cindy"],
                   'hobi': ["belajar", "makan", "belajar"]})

df_b = pd.DataFrame({'no': [4, 5, 6],
                   'nama': ["Dani", "Emma", 'Fanny'],
                   'hobi': ["makan", "makan", "jalan-jalan"]})

df_a

   no   nama     hobi
0   1  Ahmad  belajar
1   2   Budi    makan
2   3  Cindy  belajar

In [14]:
df_b

   no   nama         hobi
0   4   Dani        makan
1   5   Emma        makan
2   6  Fanny  jalan-jalan

In [15]:
df_all = df_a.append(df_b)
df_all

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
0   4   Dani        makan
1   5   Emma        makan
2   6  Fanny  jalan-jalan

### menggabungkan DataFrame dengan kolom yang berbeda

In [16]:
data = pd.DataFrame({'no': [1, 2, 3, 4, 5, 6],
                     'nama': ['Ahmad', 'Budi', 'Cindy', 'Dani', 'Emma', 'Fanny'],
                     'hobi': ["belajar", "makan", "belajar", "makan", "makan", "jalan-jalan"]})

data

   no   nama         hobi
0   1  Ahmad      belajar
1   2   Budi        makan
2   3  Cindy      belajar
3   4   Dani        makan
4   5   Emma        makan
5   6  Fanny  jalan-jalan

In [17]:
data1 = pd.DataFrame({'nama': ['Ahmad', 'Budi', 'Cindy', 'Dani', 'Emma', 'Fanny'],
                      'usia': [15, 16, 17, 22, 34, 33]})

data1

    nama  usia
0  Ahmad    15
1   Budi    16
2  Cindy    17
3   Dani    22
4   Emma    34
5  Fanny    33

In [18]:
data_all = data.merge(data1, on='nama', how='inner')
data_all

   no   nama         hobi  usia
0   1  Ahmad      belajar    15
1   2   Budi        makan    16
2   3  Cindy      belajar    17
3   4   Dani        makan    22
4   5   Emma        makan    34
5   6  Fanny  jalan-jalan    33

Jika tabel memiliki nama kolom yang berbeda maka kita bisa menentukan nama kolom dengan ```left_on``` dan ```right_on```.
 Cara menentukan merge dengan ```how``` bisa ditentukan dengan ```left```, ```right```, dan ```inner```. Dengan default ```inner```.